### Terraform Plan Results

| Check | Status |
|-------|--------|
| Format | ✅ |
| Validate | ✅ |
| Plan | ✅ |

<details><summary>Show Plan Output</summary>

```hcl
Acquiring state lock. This may take a few moments...
random_string.st_suffix: Refreshing state... [id=otc5zl]
data.azurerm_dns_zone.primary: Reading...
data.azurerm_client_config.current: Reading...
azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/pvc-shared-costops-rg-san]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD04YTJhMGNhYi1iMzVlLTQyMTgtOTRlYS0wYjhhYzc5NTUwZTM7b2JqZWN0SWQ9ZTEwNjYyZmQtMDE4Yy00NDRhLTk5ZTctMGIzMWZmNGIxY2YyO3N1YnNjcmlwdGlvbklkPTIyZjllYjE4LTY1NTMtNGI3ZC05NDUxLTQ3ZDAxOTUwODVmZTt0ZW5hbnRJZD03ZWRmNDQyMy1jY2IzLTQyNzUtYmM4MC02NGRhZTNlZjAxNDg=]
azurerm_user_assigned_identity.api_mi[0]: Refreshing state... [id=/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/pvc-shared-costops-rg-san/providers/Microsoft.ManagedIdentity/userAssignedIdentities/pvc-shared-costops-api-mi-san]
azurerm_user_assigned_identity.ingest_mi: Refreshing state... [id=/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/pvc-shared-costops-rg-san/providers/Microsoft.ManagedIdentity/userAssignedIdentities/pvc-shared-costops-mi-san]
azurerm_dashboard_grafana.grafana[0]: Refreshing state... [id=/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/pvc-shared-costops-rg-san/providers/Microsoft.Dashboard/grafana/pvc-costops-amg-san]
azurerm_monitor_data_collection_endpoint.focus_cost[0]: Refreshing state... [id=/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/pvc-shared-costops-rg-san/providers/Microsoft.Insights/dataCollectionEndpoints/pvc-costops-dce-san]
azurerm_log_analytics_workspace.law: Refreshing state... [id=/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/pvc-shared-costops-rg-san/providers/Microsoft.OperationalInsights/workspaces/pvc-shared-costops-law-san]
azurerm_storage_account.st: Refreshing state... [id=/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/pvc-shared-costops-rg-san/providers/Microsoft.Storage/storageAccounts/pvccostopsstsanotc5zl]
azurerm_storage_container.exports: Refreshing state... [id=/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/pvc-shared-costops-rg-san/providers/Microsoft.Storage/storageAccounts/pvccostopsstsanotc5zl/blobServices/default/containers/cost-exports]
azurerm_role_assignment.ingest_law_reader[0]: Refreshing state... [id=/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/pvc-shared-costops-rg-san/providers/Microsoft.OperationalInsights/workspaces/pvc-shared-costops-law-san/providers/Microsoft.Authorization/roleAssignments/d47ce431-93d3-9733-2ce8-aeb8348bc72b]
azurerm_container_app_environment.cae: Refreshing state... [id=/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/pvc-shared-costops-rg-san/providers/Microsoft.App/managedEnvironments/pvc-shared-costops-cae-san]
azurerm_log_analytics_workspace_table_custom_log.action_log[0]: Refreshing state... [id=/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/pvc-shared-costops-rg-san/providers/Microsoft.OperationalInsights/workspaces/pvc-shared-costops-law-san/tables/ActionLog_CL]
azurerm_log_analytics_workspace_table_custom_log.focus_cost[0]: Refreshing state... [id=/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/pvc-shared-costops-rg-san/providers/Microsoft.OperationalInsights/workspaces/pvc-shared-costops-law-san/tables/FocusCost_CL]
azurerm_monitor_data_collection_rule.focus_cost[0]: Refreshing state... [id=/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/pvc-shared-costops-rg-san/providers/Microsoft.Insights/dataCollectionRules/pvc-costops-dcr-focus-san]
azurerm_role_assignment.ingest_storage_blob_contributor: Refreshing state... [id=/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/pvc-shared-costops-rg-san/providers/Microsoft.Storage/storageAccounts/pvccostopsstsanotc5zl/blobServices/default/containers/cost-exports/providers/Microsoft.Authorization/roleAssignments/6f11d3bf-dca0-e2aa-dda2-fbbe72b84c02]
azurerm_role_assignment.grafana_monitoring_reader[0]: Refreshing state... [id=/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/providers/Microsoft.Authorization/roleAssignments/225c5dd6-a5a3-6498-1ebb-b48b9fd09064]
azurerm_role_assignment.grafana_law_reader[0]: Refreshing state... [id=/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/pvc-shared-costops-rg-san/providers/Microsoft.OperationalInsights/workspaces/pvc-shared-costops-law-san/providers/Microsoft.Authorization/roleAssignments/58ad2eaa-bc77-7035-d626-01f732c283f7]
azurerm_role_assignment.grafana_admin[0]: Refreshing state... [id=/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/pvc-shared-costops-rg-san/providers/Microsoft.Dashboard/grafana/pvc-costops-amg-san/providers/Microsoft.Authorization/roleAssignments/91890a52-a2b3-dc31-5b2f-7360e080392a]
azurerm_role_assignment.api_storage_table[0]: Refreshing state... [id=/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/pvc-shared-costops-rg-san/providers/Microsoft.Storage/storageAccounts/pvccostopsstsanotc5zl/providers/Microsoft.Authorization/roleAssignments/b04ae53f-d7af-b4ab-31df-918333a08915]
azurerm_monitor_data_collection_rule.action_log[0]: Refreshing state... [id=/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/pvc-shared-costops-rg-san/providers/Microsoft.Insights/dataCollectionRules/pvc-costops-dcr-actionlog-san]
azurerm_monitor_data_collection_rule_association.focus_cost[0]: Refreshing state... [id=/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/pvc-shared-costops-rg-san/providers/Microsoft.OperationalInsights/workspaces/pvc-shared-costops-law-san/providers/Microsoft.Insights/dataCollectionRuleAssociations/focus-cost-to-law]
azurerm_role_assignment.ingest_dcr_metrics_publisher[0]: Refreshing state... [id=/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/pvc-shared-costops-rg-san/providers/Microsoft.Insights/dataCollectionRules/pvc-costops-dcr-focus-san/providers/Microsoft.Authorization/roleAssignments/79c77029-2b75-a742-014c-c2fa9021c5b9]
azurerm_container_app.cost_centre_api[0]: Refreshing state... [id=/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/pvc-shared-costops-rg-san/providers/Microsoft.App/containerApps/pvc-shared-costops-api-san]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # azurerm_container_app.cost_centre_api[0] has been deleted
  - resource "azurerm_container_app" "cost_centre_api" {
        id                            = "/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/pvc-shared-costops-rg-san/providers/Microsoft.App/containerApps/pvc-shared-costops-api-san"
        name                          = "pvc-shared-costops-api-san"
        tags                          = {}
        # (10 unchanged attributes hidden)

      - ingress {
          - fqdn                       = "pvc-shared-costops-api-san.yellowglacier-68da34dd.southafricanorth.azurecontainerapps.io" -> null
            # (7 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # azurerm_container_app_environment.cae has been deleted
  - resource "azurerm_container_app_environment" "cae" {
      - id                                          = "/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/pvc-shared-costops-rg-san/providers/Microsoft.App/managedEnvironments/pvc-shared-costops-cae-san" -> null
        name                                        = "pvc-shared-costops-cae-san"
        tags                                        = {
            "costCenter" = "infrastructure"
            "env"        = "shared"
            "managedBy"  = "terraform"
            "owner"      = "platform-engineering"
            "project"    = "pvc-costops-analytics"
        }
        # (17 unchanged attributes hidden)
    }

  # azurerm_dashboard_grafana.grafana[0] has been deleted
  - resource "azurerm_dashboard_grafana" "grafana" {
      - endpoint                               = "https://pvc-costops-amg-san-dfedf3auhnfcb6ar.weu.grafana.azure.com" -> null
        id                                     = "/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/pvc-shared-costops-rg-san/providers/Microsoft.Dashboard/grafana/pvc-costops-amg-san"
      - name                                   = "pvc-costops-amg-san" -> null
        tags                                   = {
            "costCenter" = "infrastructure"
            "env"        = "shared"
            "managedBy"  = "terraform"
            "owner"      = "platform-engineering"
            "project"    = "pvc-costops-analytics"
        }
        # (11 unchanged attributes hidden)

      - identity {
          - principal_id = "b976a47b-8422-484d-879e-b6d78f73bee3" -> null
            # (3 unchanged attributes hidden)
        }
    }

  # azurerm_log_analytics_workspace.law has been deleted
  - resource "azurerm_log_analytics_workspace" "law" {
      - id                                      = "/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/pvc-shared-costops-rg-san/providers/Microsoft.OperationalInsights/workspaces/pvc-shared-costops-law-san" -> null
        name                                    = "pvc-shared-costops-law-san"
        tags                                    = {
            "costCenter" = "infrastructure"
            "env"        = "shared"
            "managedBy"  = "terraform"
            "owner"      = "platform-engineering"
            "project"    = "pvc-costops-analytics"
        }
      - workspace_id                            = "1bc0b3d2-80bf-4e0d-bd9d-5fdf69df0527" -> null
        # (15 unchanged attributes hidden)
    }

  # azurerm_monitor_data_collection_endpoint.focus_cost[0] has been deleted
  - resource "azurerm_monitor_data_collection_endpoint" "focus_cost" {
      - id                            = "/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/pvc-shared-costops-rg-san/providers/Microsoft.Insights/dataCollectionEndpoints/pvc-costops-dce-san" -> null
      - logs_ingestion_endpoint       = "https://pvc-costops-dce-san-iydt.southafricanorth-1.ingest.monitor.azure.com" -> null
        name                          = "pvc-costops-dce-san"
        tags                          = {
            "costCenter" = "infrastructure"
            "env"        = "shared"
            "managedBy"  = "terraform"
            "owner"      = "platform-engineering"
            "project"    = "pvc-costops-analytics"
        }
        # (8 unchanged attributes hidden)
    }

  # azurerm_monitor_data_collection_rule.action_log[0] has been deleted
  - resource "azurerm_monitor_data_collection_rule" "action_log" {
      - id                          = "/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/pvc-shared-costops-rg-san/providers/Microsoft.Insights/dataCollectionRules/pvc-costops-dcr-actionlog-san" -> null
        name                        = "pvc-costops-dcr-actionlog-san"
        tags                        = {
            "costCenter" = "infrastructure"
            "env"        = "shared"
            "managedBy"  = "terraform"
            "owner"      = "platform-engineering"
            "project"    = "pvc-costops-analytics"
        }
        # (6 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_monitor_data_collection_rule.focus_cost[0] has been deleted
  - resource "azurerm_monitor_data_collection_rule" "focus_cost" {
      - id                          = "/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/pvc-shared-costops-rg-san/providers/Microsoft.Insights/dataCollectionRules/pvc-costops-dcr-focus-san" -> null
      - immutable_id                = "dcr-296bfdfcedbe418a9c9202ea3249bb83" -> null
        name                        = "pvc-costops-dcr-focus-san"
        tags                        = {
            "costCenter" = "infrastructure"
            "env"        = "shared"
            "managedBy"  = "terraform"
            "owner"      = "platform-engineering"
            "project"    = "pvc-costops-analytics"
        }
        # (5 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_resource_group.rg has been deleted
  - resource "azurerm_resource_group" "rg" {
        id         = "/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/pvc-shared-costops-rg-san"
      - location   = "southafricanorth" -> null
      - name       = "pvc-shared-costops-rg-san" -> null
        tags       = {
            "costCenter" = "infrastructure"
            "env"        = "shared"
            "managedBy"  = "terraform"
            "owner"      = "platform-engineering"
            "project"    = "pvc-costops-analytics"
        }
        # (1 unchanged attribute hidden)
    }

  # azurerm_storage_account.st has been deleted
  - resource "azurerm_storage_account" "st" {
      - id                                 = "/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/pvc-shared-costops-rg-san/providers/Microsoft.Storage/storageAccounts/pvccostopsstsanotc5zl" -> null
        name                               = "pvccostopsstsanotc5zl"
      - primary_connection_string          = (sensitive value) -> null
        tags                               = {
            "costCenter" = "infrastructure"
            "env"        = "shared"
            "managedBy"  = "terraform"
            "owner"      = "platform-engineering"
            "project"    = "pvc-costops-analytics"
        }
        # (96 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_storage_container.exports has been deleted
  - resource "azurerm_storage_container" "exports" {
        id                                = "/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/pvc-shared-costops-rg-san/providers/Microsoft.Storage/storageAccounts/pvccostopsstsanotc5zl/blobServices/default/containers/cost-exports"
      - name                              = "cost-exports" -> null
        # (9 unchanged attributes hidden)
    }

  # azurerm_user_assigned_identity.api_mi[0] has been deleted
  - resource "azurerm_user_assigned_identity" "api_mi" {
      - client_id           = "ab7b6ced-325e-4b17-8ec3-bbf0c05af13c" -> null
      - id                  = "/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/pvc-shared-costops-rg-san/providers/Microsoft.ManagedIdentity/userAssignedIdentities/pvc-shared-costops-api-mi-san" -> null
        name                = "pvc-shared-costops-api-mi-san"
      - principal_id        = "a1a2bd11-7685-4147-b5d4-bb9177a4adb5" -> null
        tags                = {
            "costCenter" = "infrastructure"
            "env"        = "shared"
            "managedBy"  = "terraform"
            "owner"      = "platform-engineering"
            "project"    = "pvc-costops-analytics"
        }
        # (4 unchanged attributes hidden)
    }

  # azurerm_user_assigned_identity.ingest_mi has been deleted
  - resource "azurerm_user_assigned_identity" "ingest_mi" {
      - client_id           = "4d44f55f-6ec5-43eb-ad00-e32b39638eb1" -> null
        id                  = "/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/pvc-shared-costops-rg-san/providers/Microsoft.ManagedIdentity/userAssignedIdentities/pvc-shared-costops-mi-san"
        name                = "pvc-shared-costops-mi-san"
      - principal_id        = "a041fbd0-a8a9-4698-ba86-9170540e30ad" -> null
        tags                = {
            "costCenter" = "infrastructure"
            "env"        = "shared"
            "managedBy"  = "terraform"
            "owner"      = "platform-engineering"
            "project"    = "pvc-costops-analytics"
        }
        # (4 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform planned the following actions, but then encountered a problem:

  # azurerm_container_app.cost_centre_api[0] will be created
  + resource "azurerm_container_app" "cost_centre_api" {
      + container_app_environment_id  = (known after apply)
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "pvc-shared-costops-api-san"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "pvc-shared-costops-rg-san"
      + revision_mode                 = "Single"

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + ingress {
          + allow_insecure_connections = false
          + custom_domain              = (known after apply)
          + external_enabled           = true
          + fqdn                       = (known after apply)
          + target_port                = 8000
          + transport                  = "http"

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + registry {
          + password_secret_name = (sensitive value)
          + server               = (sensitive value)
          + username             = (sensitive value)
        }

      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + template {
          + cooldown_period_in_seconds       = 300
          + max_replicas                     = 3
          + min_replicas                     = 0
          + polling_interval_in_seconds      = 30
          + revision_suffix                  = (known after apply)
          + termination_grace_period_seconds = 0

          + container {
              + cpu               = 0.25
              + ephemeral_storage = (known after apply)
              + image             = "ghcr.io/phoenixvc/pvc-costops-analytics-api:latest"
              + memory            = "0.5Gi"
              + name              = "api"

              + env {
                  + name  = "AZURE_CLIENT_ID"
                  + value = (known after apply)
                }
              + env {
                  + name  = "AZURE_SUBSCRIPTION_ID"
                  + value = (sensitive value)
                }
              + env {
                  + name  = "AZURE_DEFAULT_SUBSCRIPTION_ID"
                  + value = (sensitive value)
                }
              + env {
                  + name  = "AZURE_AD_CLIENT_ID"
                  + value = "f6c75495-4566-4263-9045-d2f4818b892d"
                }
              + env {
                  + name  = "AZURE_AD_TENANT_ID"
                  + value = "7edf4423-ccb3-4275-bc80-64dae3ef0148"
                }
              + env {
                  + name        = (sensitive value)
                  + secret_name = (sensitive value)
                }
              + env {
                  + name  = "LOG_ANALYTICS_WORKSPACE_ID"
                  + value = (known after apply)
                }
              + env {
                  + name  = "LOG_ANALYTICS_ACTIONLOG_DCR_ID"
                  + value = (known after apply)
                }
              + env {
                  + name  = "LOG_ANALYTICS_ACTIONLOG_STREAM"
                  + value = "Custom-ActionLog_CL"
                }
              + env {
                  + name  = "LOG_ANALYTICS_DCE_URI"
                  + value = (known after apply)
                }

              + liveness_probe {
                  + failure_count_threshold          = 3
                  + initial_delay                    = 10
                  + interval_seconds                 = 30
                  + path                             = "/health"
                  + port                             = 8000
                  + termination_grace_period_seconds = (known after apply)
                  + timeout                          = 1
                  + transport                        = "HTTP"
                }

              + readiness_probe {
                  + failure_count_threshold = 3
                  + initial_delay           = 5
                  + interval_seconds        = 10
                  + path                    = "/health"
                  + port                    = 8000
                  + success_count_threshold = 1
                  + timeout                 = 1
                  + transport               = "HTTP"
                }
            }
        }
    }

  # azurerm_container_app_environment.cae will be created
  + resource "azurerm_container_app_environment" "cae" {
      + custom_domain_verification_id    = (known after apply)
      + default_domain                   = (known after apply)
      + docker_bridge_cidr               = (known after apply)
      + id                               = (known after apply)
      + internal_load_balancer_enabled   = false
      + location                         = "southafricanorth"
      + log_analytics_workspace_id       = (known after apply)
      + logs_destination                 = (known after apply)
      + mutual_tls_enabled               = false
      + name                             = "pvc-shared-costops-cae-san"
      + platform_reserved_cidr           = (known after apply)
      + platform_reserved_dns_ip_address = (known after apply)
      + public_network_access            = (known after apply)
      + resource_group_name              = "pvc-shared-costops-rg-san"
      + static_ip_address                = (known after apply)
      + tags                             = {
          + "costCenter" = "infrastructure"
          + "env"        = "shared"
          + "managedBy"  = "terraform"
          + "owner"      = "platform-engineering"
          + "project"    = "pvc-costops-analytics"
        }
      + zone_redundancy_enabled          = false
    }

  # azurerm_log_analytics_workspace.law will be created
  + resource "azurerm_log_analytics_workspace" "law" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = (known after apply)
      + local_authentication_enabled    = (known after apply)
      + location                        = "southafricanorth"
      + name                            = "pvc-shared-costops-law-san"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "pvc-shared-costops-rg-san"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + tags                            = {
          + "costCenter" = "infrastructure"
          + "env"        = "shared"
          + "managedBy"  = "terraform"
          + "owner"      = "platform-engineering"
          + "project"    = "pvc-costops-analytics"
        }
      + workspace_id                    = (known after apply)
    }

  # azurerm_log_analytics_workspace_table_custom_log.action_log[0] will be created
  + resource "azurerm_log_analytics_workspace_table_custom_log" "action_log" {
      + id              = (known after apply)
      + name            = "ActionLog_CL"
      + plan            = "Analytics"
      + solutions       = (known after apply)
      + standard_column = (known after apply)
      + workspace_id    = (known after apply)

      + column {
          + name = "TimeGenerated"
          + type = "dateTime"
        }
      + column {
          + name = "action_type"
          + type = "string"
        }
      + column {
          + name = "resource_name"
          + type = "string"
        }
      + column {
          + name = "resource_type"
          + type = "string"
        }
      + column {
          + name = "status"
          + type = "string"
        }
      + column {
          + name = "reason"
          + type = "string"
        }
      + column {
          + name = "iac_managed"
          + type = "boolean"
        }
      + column {
          + name = "estimated_monthly_savings"
          + type = "real"
        }
      + column {
          + name = "actor"
          + type = "string"
        }
    }

  # azurerm_log_analytics_workspace_table_custom_log.focus_cost[0] will be created
  + resource "azurerm_log_analytics_workspace_table_custom_log" "focus_cost" {
      + id              = (known after apply)
      + name            = "FocusCost_CL"
      + plan            = "Analytics"
      + solutions       = (known after apply)
      + standard_column = (known after apply)
      + workspace_id    = (known after apply)

      + column {
          + name = "TimeGenerated"
          + type = "dateTime"
        }
      + column {
          + name = "BillingAccountId"
          + type = "string"
        }
      + column {
          + name = "ChargePeriodStart"
          + type = "dateTime"
        }
      + column {
          + name = "ChargePeriodEnd"
          + type = "dateTime"
        }
      + column {
          + name = "ChargeCategory"
          + type = "string"
        }
      + column {
          + name = "ChargeDescription"
          + type = "string"
        }
      + column {
          + name = "BilledCost"
          + type = "real"
        }
      + column {
          + name = "EffectiveCost"
          + type = "real"
        }
      + column {
          + name = "BillingCurrency"
          + type = "string"
        }
      + column {
          + name = "ResourceId"
          + type = "string"
        }
      + column {
          + name = "ResourceName"
          + type = "string"
        }
      + column {
          + name = "ResourceType"
          + type = "string"
        }
      + column {
          + name = "RegionName"
          + type = "string"
        }
      + column {
          + name = "x_ResourceGroupName"
          + type = "string"
        }
      + column {
          + name = "ServiceName"
          + type = "string"
        }
      + column {
          + name = "ServiceCategory"
          + type = "string"
        }
      + column {
          + name = "SubAccountId"
          + type = "string"
        }
      + column {
          + name = "SubAccountName"
          + type = "string"
        }
      + column {
          + name = "Tags"
          + type = "string"
        }
    }

  # azurerm_monitor_data_collection_endpoint.focus_cost[0] will be created
  + resource "azurerm_monitor_data_collection_endpoint" "focus_cost" {
      + configuration_access_endpoint = (known after apply)
      + id                            = (known after apply)
      + immutable_id                  = (known after apply)
      + location                      = "southafricanorth"
      + logs_ingestion_endpoint       = (known after apply)
      + metrics_ingestion_endpoint    = (known after apply)
      + name                          = "pvc-costops-dce-san"
      + public_network_access_enabled = true
      + resource_group_name           = "pvc-shared-costops-rg-san"
      + tags                          = {
          + "costCenter" = "infrastructure"
          + "env"        = "shared"
          + "managedBy"  = "terraform"
          + "owner"      = "platform-engineering"
          + "project"    = "pvc-costops-analytics"
        }
    }

  # azurerm_monitor_data_collection_rule.action_log[0] will be created
  + resource "azurerm_monitor_data_collection_rule" "action_log" {
      + data_collection_endpoint_id = (known after apply)
      + id                          = (known after apply)
      + immutable_id                = (known after apply)
      + location                    = "southafricanorth"
      + name                        = "pvc-costops-dcr-actionlog-san"
      + resource_group_name         = "pvc-shared-costops-rg-san"
      + tags                        = {
          + "costCenter" = "infrastructure"
          + "env"        = "shared"
          + "managedBy"  = "terraform"
          + "owner"      = "platform-engineering"
          + "project"    = "pvc-costops-analytics"
        }

      + data_flow {
          + destinations  = [
              + "ActionLogLA",
            ]
          + output_stream = "Custom-ActionLog_CL"
          + streams       = [
              + "Custom-ActionLog_CL",
            ]
          + transform_kql = "source"
        }

      + destinations {
          + log_analytics {
              + name                  = "ActionLogLA"
              + workspace_resource_id = (known after apply)
            }
        }

      + stream_declaration {
          + stream_name = "Custom-ActionLog_CL"

          + column {
              + name = "TimeGenerated"
              + type = "datetime"
            }
          + column {
              + name = "action_type"
              + type = "string"
            }
          + column {
              + name = "resource_name"
              + type = "string"
            }
          + column {
              + name = "resource_type"
              + type = "string"
            }
          + column {
              + name = "status"
              + type = "string"
            }
          + column {
              + name = "reason"
              + type = "string"
            }
          + column {
              + name = "iac_managed"
              + type = "boolean"
            }
          + column {
              + name = "estimated_monthly_savings"
              + type = "real"
            }
          + column {
              + name = "actor"
              + type = "string"
            }
        }
    }

  # azurerm_monitor_data_collection_rule.focus_cost[0] will be created
  + resource "azurerm_monitor_data_collection_rule" "focus_cost" {
      + data_collection_endpoint_id = (known after apply)
      + id                          = (known after apply)
      + immutable_id                = (known after apply)
      + location                    = "southafricanorth"
      + name                        = "pvc-costops-dcr-focus-san"
      + resource_group_name         = "pvc-shared-costops-rg-san"
      + tags                        = {
          + "costCenter" = "infrastructure"
          + "env"        = "shared"
          + "managedBy"  = "terraform"
          + "owner"      = "platform-engineering"
          + "project"    = "pvc-costops-analytics"
        }

      + data_flow {
          + destinations  = [
              + "FocusCostLA",
            ]
          + output_stream = "Custom-FocusCost_CL"
          + streams       = [
              + "Custom-FocusCost_CL",
            ]
          + transform_kql = "source"
        }

      + destinations {
          + log_analytics {
              + name                  = "FocusCostLA"
              + workspace_resource_id = (known after apply)
            }
        }

      + stream_declaration {
          + stream_name = "Custom-FocusCost_CL"

          + column {
              + name = "TimeGenerated"
              + type = "datetime"
            }
          + column {
              + name = "BillingAccountId"
              + type = "string"
            }
          + column {
              + name = "ChargePeriodStart"
              + type = "datetime"
            }
          + column {
              + name = "ChargePeriodEnd"
              + type = "datetime"
            }
          + column {
              + name = "ChargeCategory"
              + type = "string"
            }
          + column {
              + name = "ChargeDescription"
              + type = "string"
            }
          + column {
              + name = "BilledCost"
              + type = "real"
            }
          + column {
              + name = "EffectiveCost"
              + type = "real"
            }
          + column {
              + name = "BillingCurrency"
              + type = "string"
            }
          + column {
              + name = "ResourceId"
              + type = "string"
            }
          + column {
              + name = "ResourceName"
              + type = "string"
            }
          + column {
              + name = "ResourceType"
              + type = "string"
            }
          + column {
              + name = "RegionName"
              + type = "string"
            }
          + column {
              + name = "x_ResourceGroupName"
              + type = "string"
            }
          + column {
              + name = "ServiceName"
              + type = "string"
            }
          + column {
              + name = "ServiceCategory"
              + type = "string"
            }
          + column {
              + name = "SubAccountId"
              + type = "string"
            }
          + column {
              + name = "SubAccountName"
              + type = "string"
            }
          + column {
              + name = "Tags"
              + type = "string"
            }
        }
    }

  # azurerm_monitor_data_collection_rule_association.focus_cost[0] will be created
  + resource "azurerm_monitor_data_collection_rule_association" "focus_cost" {
      + data_collection_rule_id = (known after apply)
      + id                      = (known after apply)
      + name                    = "focus-cost-to-law"
      + target_resource_id      = (known after apply)
    }

  # azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "southafricanorth"
      + name     = "pvc-shared-costops-rg-san"
      + tags     = {
          + "costCenter" = "infrastructure"
          + "env"        = "shared"
          + "managedBy"  = "terraform"
          + "owner"      = "platform-engineering"
          + "project"    = "pvc-costops-analytics"
        }
    }

  # azurerm_role_assignment.api_storage_table[0] will be created
  + resource "azurerm_role_assignment" "api_storage_table" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Table Data Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.grafana_monitoring_reader[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "azurerm_role_assignment" "grafana_monitoring_reader" {
      - id                                     = "/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/providers/Microsoft.Authorization/roleAssignments/225c5dd6-a5a3-6498-1ebb-b48b9fd09064" -> null
      - name                                   = "225c5dd6-a5a3-6498-1ebb-b48b9fd09064" -> null
      - principal_id                           = "b976a47b-8422-484d-879e-b6d78f73bee3" -> null
      - principal_type                         = "ServicePrincipal" -> null
      - role_definition_id                     = "/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" -> null
      - role_definition_name                   = "Monitoring Reader" -> null
      - scope                                  = (sensitive value) -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_role_assignment.ingest_dcr_metrics_publisher[0] will be created
  + resource "azurerm_role_assignment" "ingest_dcr_metrics_publisher" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Metrics Publisher"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.ingest_law_reader[0] will be created
  + resource "azurerm_role_assignment" "ingest_law_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Log Analytics Reader"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.ingest_storage_blob_contributor will be created
  + resource "azurerm_role_assignment" "ingest_storage_blob_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_storage_account.st will be created
  + resource "azurerm_storage_account" "st" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = false
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "southafricanorth"
      + min_tls_version                    = "TLS1_2"
      + name                               = "pvccostopsstsanotc5zl"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "pvc-shared-costops-rg-san"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "costCenter" = "infrastructure"
          + "env"        = "shared"
          + "managedBy"  = "terraform"
          + "owner"      = "platform-engineering"
          + "project"    = "pvc-costops-analytics"
        }

      + blob_properties {
          + change_feed_enabled      = false
          + default_service_version  = (known after apply)
          + last_access_time_enabled = false
          + versioning_enabled       = true
        }

      + network_rules (known after apply)

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # azurerm_storage_container.exports will be created
  + resource "azurerm_storage_container" "exports" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "cost-exports"
      + resource_manager_id               = (known after apply)
      + storage_account_id                = (known after apply)
    }

  # azurerm_user_assigned_identity.api_mi[0] will be created
  + resource "azurerm_user_assigned_identity" "api_mi" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "southafricanorth"
      + name                = "pvc-shared-costops-api-mi-san"
      + principal_id        = (known after apply)
      + resource_group_name = "pvc-shared-costops-rg-san"
      + tags                = {
          + "costCenter" = "infrastructure"
          + "env"        = "shared"
          + "managedBy"  = "terraform"
          + "owner"      = "platform-engineering"
          + "project"    = "pvc-costops-analytics"
        }
      + tenant_id           = (known after apply)
    }

  # azurerm_user_assigned_identity.ingest_mi will be created
  + resource "azurerm_user_assigned_identity" "ingest_mi" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "southafricanorth"
      + name                = "pvc-shared-costops-mi-san"
      + principal_id        = (known after apply)
      + resource_group_name = "pvc-shared-costops-rg-san"
      + tags                = {
          + "costCenter" = "infrastructure"
          + "env"        = "shared"
          + "managedBy"  = "terraform"
          + "owner"      = "platform-engineering"
          + "project"    = "pvc-costops-analytics"
        }
      + tenant_id           = (known after apply)
    }

Plan: 18 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ cost_centre_api_url            = "https://pvc-shared-costops-api-san.yellowglacier-68da34dd.southafricanorth.azurecontainerapps.io" -> (known after apply)
  - grafana_endpoint               = "https://pvc-costops-amg-san-dfedf3auhnfcb6ar.weu.grafana.azure.com" -> null
  - grafana_name                   = "pvc-costops-amg-san" -> null
  ~ ingestion_identity_client_id   = "4d44f55f-6ec5-43eb-ad00-e32b39638eb1" -> (known after apply)
  ~ log_analytics_dce_uri          = "https://pvc-costops-dce-san-iydt.southafricanorth-1.ingest.monitor.azure.com" -> (known after apply)
  ~ log_analytics_dcr_immutable_id = "dcr-296bfdfcedbe418a9c9202ea3249bb83" -> (known after apply)
  ~ log_analytics_workspace_id     = "1bc0b3d2-80bf-4e0d-bd9d-5fdf69df0527" -> (known after apply)

Error: Dns Zone (Subscription: "22f9eb18-6553-4b7d-9451-47d0195085fe"
Resource Group Name: "phoenixvc-dns-rg"
Dns Zone Name: "phoenixvc.tech") was not found

  with data.azurerm_dns_zone.primary,
  on dns.tf line 4, in data "azurerm_dns_zone" "primary":
   4: data "azurerm_dns_zone" "primary" {

Dns Zone (Subscription: "22f9eb18-6553-4b7d-9451-47d0195085fe"
Resource Group Name: "phoenixvc-dns-rg"
Dns Zone Name: "phoenixvc.tech") was not found
Releasing state lock. This may take a few moments...
::error::Terraform exited with code 1.
```

</details>